package main

// 通道有发送（send）、接收(receive）和关闭（close）三种操作。
// 发送和接收都使用 `<-` 符号。
// 现在我们先使用以下语句定义一个通道：

func main() {
	// 无缓冲通道，下面的代码会报错，解决看 `channel/4.go` 文件
	ch := make(chan int)

	// 发送
	ch <- 10 // 把 10 发送到 ch 中

	// 接受
	x := <-ch // 从 ch 中接收值并赋值给变量x
	println(x)
	<-ch // 从 ch 中接收值，忽略结果

	// 关于关闭通道需要注意的事情是，只有在通知接收方 goroutine 所有的数据都发送完毕的时候才需要关闭通道。
	// 通道是可以被垃圾回收机制回收的，它和关闭文件是不一样的，在结束操作之后关闭文件是必须要做的，但关闭通道不是必须的。
	// 关闭后的通道有以下特点：
	// 1. 对一个关闭的通道再发送值就会导致 panic。
	// 2. 对一个关闭的通道进行接收会一直获取值直到通道为空。
	// 3. 对一个关闭的并且没有值的通道执行接收操作会得到对应类型的零值。
	// 4. 关闭一个已经关闭的通道会导致 panic。

	// 关闭
	close(ch)
}
